Распоковать, установить зависимые пакеты питона. Далее проверить версию питона, минимальная версия должна быть не ниже 3.7 (проверено 3.7.4). Внимательно посмотреть в главной ветке как прикреплять уже созданный бот, так же добавленный в группу в телеграме с открытым каналом() иначе могут быть проблемы с первой связкой, после можете закрыть канал. 
Идея заключается в перенаправленний пакетов данных через вэбхук, который защищен телеграмовским соеденением.
После можете извращаться с вэбхуком, в случае если данные тянутся с разных серверов, либо серверы разделены на стэйдж, дев и прод. В этом случае можно закрасить вэбхуком приходящие данные, что бы не путаться с каких серверов приходят алерты(красный - прод, желтые - дев, соответственно зеленые со стейджа)

Ближайщее время здесь будут настроенные на основе ансибла, готовые к бою с одной кнопки настроенные алерты с тысяча серверов (Если у кого есть эти самые сервера)
Тоесть свернутое в докер с отказоустойчивым кубером, настроенным ансиблом со всей звурушкой. В других разделах()папок, да упаси боже, в других каталогах подробности как настравивать, тероформс с нетбоксом.
Если не сойду с ума, будем разбиратся с CI/CD, будем разворачивать гитхаб с автоматическими ранерами, что бы рукожопные програмисты не сернули в наши доблесные души сист.админов(Заметьте DevOps - эта философия а не профессия =) )
